xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Samples/Nu_LB/UAC/UAC_Class.c
/******************************************************************************
 * @file     UAC_Class.c
 * @brief    Nano1xx USB Driver Sample code
 * @version  1.0.1
 * @date     04, September, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <string.h>
#include "nano1xx_i2c.h"
#include "nano1xx_i2s.h"
#include "nano1xx_usb.h"
#include "nano1xx_gpio.h"
#include "nano1xx_pdma.h"
#include "UAC_Class.h"

/* Define the vendor id and product id */
#define USB_VID		0x0416  /* Vendor ID */
#define USB_PID		0x1000  /* Product ID */

/* Define EP maximum packet size */
#define	UAC_MAX_PACKET_SIZE_EP0		64
#define MAX_PACKET_SIZE_ISO_OUT		PLAY_RATE*PLAY_CHANNELS*2/1000
#define MAX_PACKET_SIZE_ISO_IN		REC_RATE*REC_CHANNELS*2/1000

/* Define the interrupt In EP number */
#define ISO_IN_EP_NUM    0x01
#define ISO_OUT_EP_NUM   0x02

/* Define Descriptor information */
#if(PLAY_CHANNELS == 1)
#define PLAY_CH_CFG     1
#endif
#if(PLAY_CHANNELS == 2)
#define PLAY_CH_CFG     3
#endif

#if(REC_CHANNELS == 1)
#define REC_CH_CFG     1
#endif
#if(REC_CHANNELS == 2)
#define REC_CH_CFG     3
#endif

#define PLAY_RATE_LO    (PLAY_RATE & 0xFF)
#define PLAY_RATE_MD    ((PLAY_RATE >> 8) & 0xFF)
#define PLAY_RATE_HI    ((PLAY_RATE >> 16) & 0xFF)

#define REC_RATE_LO     (REC_RATE & 0xFF)
#define REC_RATE_MD     ((REC_RATE >> 8) & 0xFF)
#define REC_RATE_HI     ((REC_RATE >> 16) & 0xFF)


/*!<USB Device Descriptor */
const uint8_t USB_DeviceDescriptor[] =
{
	LEN_DEVICE,		/* bLength */
	DESC_DEVICE,	/* bDescriptorType */
	0x10, 0x01,		/* bcdUSB */
	0x00,			/* bDeviceClass */
	0x00,			/* bDeviceSubClass */
	0x00,			/* bDeviceProtocol */
	UAC_MAX_PACKET_SIZE_EP0,	/* bMaxPacketSize0 */
	/* idVendor */
	USB_VID & 0x00FF,
	(USB_VID & 0xFF00) >> 8,
	/* idProduct */
	USB_PID & 0x00FF,
	(USB_PID & 0xFF00) >> 8,
	0x00, 0x01,		/* bcdDevice */
	0x01, 			/* iManufacture */
	0x02, 			/* iProduct */
	0x00, 			/* iSerialNumber */
	0x01			/* bNumConfigurations */
};

/*!<USB Configure Descriptor */
const uint8_t USB_ConfigDescriptor[] =
{
	LEN_CONFIG,     /* bLength */
	DESC_CONFIG,    /* bDescriptorType */
	0xC0,0x00,      /* wTotalLength */
	0x03,           /* bNumInterfaces */
	0x01,           /* bConfigurationValue */
	0x00,           /* iConfiguration */
	0x80,           /* bmAttributes */
	0x20,           /* Max power */

	/* Standard AC inteface */
	0x09,           /* bLength */
	0x04,           /* bDescriptorType */
	0x00,           /* bInterfaceNumber */
	0x00,           /* bAlternateSetting */
	0x00,           /* bNumEndpoints */
	0x01,           /* bInterfaceClass:AUDIO */
	0x01,           /* bInterfaceSubClass:AUDIOCONTROL */
	0x00,           /* bInterfaceProtocol */
	0x00,           /* iInterface */

	/* Class-spec AC interface descriptor */
	0x0A,           /* bLength */
	0x24,           /* bDescriptorType:CS_INTERFACE */
	0x01,           /* bDescriptorSubType:HEADER */
	0x00,0x01,      /* bcdADC:1.0 */
	0x46,0x00,      /* wTotalLength */
	0x02,           /* bInCollection */
	0x01,           /* baInterfaceNr(1) */
	0x02,           /* baInterfaceNr(n) */
	
	/* TID 1: Input for usb streaming */
    0x0C,               /* bLength */
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x02,               /* bDescriptorSubType:INPUT_TERMINAL */
    0x01,               /* bTerminalID */
    0x01,0x01,          /* wTerminalType: 0x0101 usb streaming */
    0x00,               /* bAssocTerminal */
    PLAY_CHANNELS,      /* bNrChannels */
    PLAY_CH_CFG,0x00,   /* wChannelConfig */
    0x00,               /* iChannelNames */
    0x00,               /* iTerminal */

    /* UNIT ID 5: Feature Unit */
    0x08,               /* bLength */
    0x24,               /* bDescriptorType */
    0x06,               /* bDescriptorSubType */
    REC_FEATURE_UNITID, /* bUnitID */
    0x04,               /* bSourceID */
    0x01,               /* bControlSize */
    0x03,               /* bmaControls(0) */
    0x00,               /* iFeature */

	/* TID 2: Output Terminal for usb streaming */
	0x09,               /* bLength */
	0x24,               /* bDescriptorType:CS_INTERFACE */
	0x03,               /* bDescriptorSubType:OUTPUT_TERMINAL */
	0x02,               /* bTerminalID */
	0x01,0x01,          /* wTerminalType: 0x0101 usb streaming */
	0x00,               /* bAssocTerminal */
	REC_FEATURE_UNITID, /* bSourceID */
	0x00,               /* iTerminal */

    /* UNIT ID 6: Feature Unit */
    0x0A,               /* bLength */
    0x24,               /* bDescriptorType */
    0x06,               /* bDescriptorSubType */
    PLAY_FEATURE_UNITID, /* bUnitID */
    0x01,               /* bSourceID */
    0x01,               /* bControlSize */
    0x01,               /* bmaControls(0) */
    0x02,               /* bmaControls(0) */
    0x02,               /* bmaControls(0) */
    0x00,               /* iFeature */
	
	/* TID 3: Output for speaker */
    0x09,           /* bLength*/
    0x24,           /* bDescriptorType:CS_INTERFACE*/
    0x03,           /* bDescriptorSubType:OUTPUT_TERMINAL*/
    0x03,           /* bTerminalID*/
    0x01,0x03,      /* wTerminalType: 0x0301 speaker*/
    0x00,           /* bAssocTerminal*/
    0x06, /* bSourceID*/
    0x00,           /* iTerminal*/

	/* TID 4: Input Terminal for microphone */
	0x0C,               /* bLength */
	0x24,               /* bDescriptorType:CS_INTERFACE */
	0x02,               /* bDescriptorSubType:INPUT_TERMINAL*/
	0x04,               /* bTerminalID*/
	0x01,0x02,          /* wTerminalType: 0x0201 microphone*/
	0x00,               /* bAssocTerminal*/
	REC_CHANNELS,       /* bNrChannels*/
	REC_CH_CFG, 0x00,   /* wChannelConfig*/
	0x00,               /* iChannelNames*/
	0x00,               /* iTerminal*/

