xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Samples/Nu_LB/UAC/UAC_Class.c
	/* get control pipe SRAM buffer */
	ptr = (uint8_t *)((uint32_t)USBD_SRAM_BASE + (uint32_t)USBD->BUFSEG0);

	switch(gUsbCtrl.UsbSetupBuf[1])
	{
		case UAC_SET_CUR:
		{
			if (REC_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch ( gUsbCtrl.UsbSetupBuf[3])
				{
					case MUTE_CONTROL:
					case VOLUME_CONTROL:
						USBD->MXPLD1 = gUsbCtrl.UsbSetupBuf[6];
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else if (PLAY_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch ( gUsbCtrl.UsbSetupBuf[3])
				{
					case MUTE_CONTROL:
					case VOLUME_CONTROL:
						USBD->MXPLD1 = gUsbCtrl.UsbSetupBuf[6];
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else
			{
				/* STALL control pipe */
				USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
				USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
			}
			gUsbCtrl.StateFlag = FLAG_UAC_SET_CUR;
			return TRUE;
		}

		case UAC_GET_CUR:
		{
			if(REC_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch ( gUsbCtrl.UsbSetupBuf[3])
				{
					case MUTE_CONTROL:
					{
						*ptr = gUacInfo.RecMute;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 1;
						break;
					}
					case VOLUME_CONTROL:
					{
						*ptr = (uint8_t)gUacInfo.RecVolume;
						*(ptr+1) = (uint8_t)gUacInfo.RecVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					}
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else if (PLAY_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch ( gUsbCtrl.UsbSetupBuf[3])
				{
					case MUTE_CONTROL:
					{
						*ptr = gUacInfo.PlayMute;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 1;
						break;
					}
					case VOLUME_CONTROL:
					{
						if(gUsbCtrl.UsbSetupBuf[2] == 1)
						{
							*ptr = (uint8_t)gUacInfo.PlayVolumeL;
							*(ptr+1) = (uint8_t)gUacInfo.PlayVolumeL >> 8;
						}
						else
						{
							*ptr = (uint8_t)gUacInfo.PlayVolumeR;
							*(ptr+1) = (uint8_t)gUacInfo.PlayVolumeR >> 8;
						}
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					}
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else
			{
				/* STALL control pipe */
				USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
				USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
			}
			// Trigger next Control Out DATA1 Transaction.
			USBD->CFG1 |= USB_CFG_DSQ_SYNC_DATA1;
			USBD->MXPLD1 = 0;
			return TRUE;
		}

		case UAC_GET_MIN:
		{
			if (REC_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.RecMinVolume;
						*(ptr+1) = (uint8_t)gUacInfo.RecMinVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else if (PLAY_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.PlayMinVolume;
						*(ptr+1) = (uint8_t)gUacInfo.PlayMinVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else
			{
				/* STALL control pipe */
				USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
				USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
			}
			// Trigger next Control Out DATA1 Transaction.
			USBD->CFG1 |= USB_CFG_DSQ_SYNC_DATA1;
			USBD->MXPLD1 = 0;
			return TRUE;
		}

		case UAC_GET_MAX:
		{
			if (REC_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.RecMaxVolume;
						*(ptr+1) = (uint8_t)gUacInfo.RecMaxVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else if (PLAY_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.PlayMaxVolume;
						*(ptr+1) = (uint8_t)gUacInfo.PlayMaxVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else
			{
				/* STALL control pipe */
				USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
				USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
			}
			// Trigger next Control Out DATA1 Transaction.
			USBD->CFG1 |= USB_CFG_DSQ_SYNC_DATA1;
			USBD->MXPLD1 = 0;
			return TRUE;
		}

		case UAC_GET_RES:
		{
			if (REC_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.RecResVolume;
						*(ptr+1) = (uint8_t)gUacInfo.RecResVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else if (PLAY_FEATURE_UNITID == gUsbCtrl.UsbSetupBuf[5])
			{
				switch (gUsbCtrl.UsbSetupBuf[3])
				{
					case VOLUME_CONTROL:
						*ptr = (uint8_t)gUacInfo.PlayResVolume;
						*(ptr+1) = (uint8_t)gUacInfo.PlayResVolume >> 8;
						USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
						USBD->MXPLD0 = 2;
						break;
					default:
						/* STALL control pipe */
						USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
						USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
						break;
				}
			}
			else
			{
				/* STALL control pipe */
				USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
				USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
			}
			// Trigger next Control Out DATA1 Transaction.
			USBD->CFG1 |= USB_CFG_DSQ_SYNC_DATA1;
			USBD->MXPLD1 = 0;
			return TRUE;
		}

		default:
		    /* Setup error, stall the device */
			USBD->CFG0 |= (USB_CFG_SSTALL | 0x8000);
			USBD->CFG1 |= (USB_CFG_SSTALL | 0x8000);
	}
	return FALSE;
}

/**   
  * @brief  USB_EpAck0, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck0(void)
{
	/* ISO IN transfer ACK */
	if (gUacInfo.AudioState == UAC_START_AUDIO_RECORD)
	{
		UAC_DeviceEnable(UAC_MICROPHONE);
		gUacInfo.AudioState = UAC_PROCESSING_AUDIO_RECORD;
	}
	else if (gUacInfo.AudioState == UAC_PROCESSING_AUDIO_RECORD)
		gUacInfo.AudioState = UAC_BUSY_AUDIO_RECORD;

