xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Samples/Nu_LB/UAC/UAC_Class.c
	if (gUacInfo.AudioState == UAC_BUSY_AUDIO_RECORD)
		SendRecData();
	else
		USBD->MXPLD2 = 0;
	return 0;
}

/**   
  * @brief  USB_EpAck1, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck1(void)
{
	/* ISO OUT transfer ACK */
	GetPlayData((int16_t *)((uint32_t)USBD_SRAM_BASE + (uint32_t)USBD->BUFSEG3), (int16_t)USBD->MXPLD3);

	USBD->MXPLD3 = MAX_PACKET_SIZE_ISO_OUT;
	return 0;
}


/**   
  * @brief  USB_EpAck2, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck2(void)
{
	return 0;
}


/**   
  * @brief  USB_EpAck3, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck3(void)
{
	return 0;
}


/**   
  * @brief  USB_EpAck4, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck4(void)
{
	return 0;
}


/**   
  * @brief  USB_EpAck5, Ack Transfer Pipe.
  * @param  None.
  * @retval None.
  */
uint32_t USB_EpAck5(void)
{
	return 0;
}


/**   
  * @brief  USB_DeviceStart, Start USB Device Transfer.
  * @param  None.
  * @retval None.
  */
void USB_DeviceStart(void)
{
}

/*********************************************************/
/* For I2C transfer */
uint32_t __IO EndFlag0 = 0;
uint8_t Device_Addr0 = 0x1A;	 			/* WAU8822 Device ID */
uint8_t Tx_Data0[2];
uint8_t DataCnt0;

/* Recoder Buffer and its pointer */
uint16_t PcmRecBuff[BUFF_LEN] = {0};
uint32_t u32RecPos_Out = 0;
uint32_t u32RecPos_In = 0;

/* Player Buffer and its pointer */
uint32_t PcmPlayBuff[BUFF_LEN] = {0};
uint32_t u32PlayPos_Out = 0;
uint32_t u32PlayPos_In = 0;


/*********************************************************/
static void RoughDelay(uint32_t t)
{
    volatile int32_t delay;

    delay = t;

    while(delay-- >= 0);
}

/**   
  * @brief  I2C_WriteWAU8822, write 9-bit data to 7-bit address register of WAU8822 with I2C interface.
  * @param  None.
  * @retval None.
  */
static void I2C_WriteWAU8822(uint8_t u8addr, uint16_t u16data)
{		
	DataCnt0 = 0;
	EndFlag0 = 0;
	
	Tx_Data0[0] = (uint8_t)((u8addr << 1) | (u16data >> 8));
	Tx_Data0[1] = (uint8_t)(u16data & 0x00FF);
			
	/* I2C0 as master sends START signal */
	I2C_Ctrl(I2C0, 1, 0, 0);
		
	/* Wait I2C0 Tx Finish */
	while (EndFlag0 == 0);
}


/**   
  * @brief  WAU8822_Setup, configure CODEC WAU8822 with I2C interface.
  * @param  None.
  * @retval None.
  */
static void WAU8822_Setup(void)
{
	I2C_WriteWAU8822(0,  0x000);   /* Reset all registers */ 
	RoughDelay(0x200);

	I2C_WriteWAU8822(1,  0x02F);        
	I2C_WriteWAU8822(2,  0x1B3);   /* Enable L/R Headphone, ADC Mix/Boost, ADC */
	I2C_WriteWAU8822(3,  0x07F);   /* Enable L/R main mixer, DAC */			
	I2C_WriteWAU8822(4,  0x010);   /* 16-bit word length, I2S format, Stereo */			
	I2C_WriteWAU8822(5,  0x000);   /* Companding control and loop back mode (all disable) */
	
	I2C_WriteWAU8822(6,  0x1AD);   /* Divide by 6, 16K */
	I2C_WriteWAU8822(7,  0x006);   /* 16K for internal filter cofficients */

	I2C_WriteWAU8822(10, 0x008);   /* DAC softmute is disabled, DAC oversampling rate is 128x */
	I2C_WriteWAU8822(14, 0x108);   /* ADC HP filter is disabled, ADC oversampling rate is 128x */
	I2C_WriteWAU8822(15, 0x1EF);   /* ADC left digital volume control */
	I2C_WriteWAU8822(16, 0x1EF);   /* ADC right digital volume control */
		
	I2C_WriteWAU8822(44, 0x000);   /* LLIN/RLIN is not connected to PGA */
	I2C_WriteWAU8822(47, 0x050);   /* LLIN connected, and its Gain value */
	I2C_WriteWAU8822(48, 0x050);   /* RLIN connected, and its Gain value */

	I2C_WriteWAU8822(50, 0x001);   /* Left DAC connected to LMIX */
	I2C_WriteWAU8822(51, 0x001);   /* Right DAC connected to RMIX */

	I2C_WriteWAU8822(52,  0x010);        
	I2C_WriteWAU8822(53,  0x010);   /* Enable L/R Headphone, ADC Mix/Boost, ADC */
}


/**   
  * @brief  SendRecData, prepare the record data for next ISO transfer.
  * @param  None.
  * @retval None.
  */
void SendRecData(void)
{
	uint16_t *pBuff;

	if ((u32RecPos_Out < u32RecPos_In - REC_LEN) || (u32RecPos_Out > u32RecPos_In))
	{
		pBuff = &PcmRecBuff[u32RecPos_Out];

		my_memcpy((uint8_t *)((uint32_t)USBD_SRAM_BASE + (uint32_t)USBD->BUFSEG2), (void *)pBuff, REC_LEN * 2);
		USBD->MXPLD2 = REC_LEN * 2;

		u32RecPos_Out += REC_LEN;

		if (u32RecPos_Out >= BUFF_LEN)
			u32RecPos_Out = 0;
	}
	else
		USBD->MXPLD2 = 0;
}


/**   
  * @brief  UAC_DeviceEnable. To enable the device to play or record audio data.
  * @param  u8Object: To select the device, UAC_MICROPHONE or UAC_SPEAKER.
  * @retval None.
  */
void UAC_DeviceEnable(uint8_t u8Object)
{
	if (u8Object == UAC_MICROPHONE)
	{
		/* Enable record hardware */
		I2S_EnableInt_RxThreshold();
		I2S_EnableRx();
	}
	else
	{
		/* Eanble play hardware */
		I2S_EnableInt_TxThreshold();	
		I2S_EnableTx();
	}
}


/**   
  * @brief  UAC_DeviceDisable. To disable the device to play or record audio data.
  * @param  u8Object: To select the device, UAC_MICROPHONE or UAC_SPEAKER.
  * @retval None.
  */
void UAC_DeviceDisable(uint8_t u8Object)
{
	if (u8Object ==  UAC_MICROPHONE )
	{
		/* Disable record hardware/stop record */
		I2S_DisableInt_RxThreshold();
		I2S_DisableRx();
	}
	else
	{
		/* Disable play hardware/stop play */
		I2S_DisableInt_TxThreshold();	
		I2S_DisableTx();
	}
}


/**   
  * @brief  GetPlayData, To get data from ISO OUT to play buffer.
  * @param  pi16src: The data buffer of ISO OUT.
  *         i16Samples: The sample number in data buffer.
  * @retval None.
  */
void GetPlayData(int16_t *pi16src, int16_t i16Samples)
{
	/* Get play data from ISO out packets */
	uint32_t u32len, i;
	uint32_t *pBuff;
	uint32_t *pSrc;

	u32len = PLAY_RATE/1000;

	pBuff = &PcmPlayBuff[u32PlayPos_In];
	pSrc = (uint32_t *) pi16src;

	for ( i = 0; i < u32len; i++ )
	{
		pBuff[i] = pSrc[i];
	}

	u32PlayPos_In += u32len;

	if (u32PlayPos_In >= BUFF_LEN)
	{
		u32PlayPos_In =	0;
	}
}


/**************************************************/
/**   
  * @brief  UAC_MainProcess, Audio Class main process.
  * @param  None.
  * @retval None.
  */

int32_t UAC_MainProcess(void)
{
	STR_USBD_T sParam;
	I2S_DATA_T st;
	
	/* Initial GPIO */
	GPIO_Init();
	/* Tri-state for FS and BCLK of CODEC */
	GPIO_Open(GPIOD, GPIO_PMD_PMD2_OPEN_DRAIN, GPIO_PMD_PMD2_MASK);
	GPIO_Open(GPIOD, GPIO_PMD_PMD3_OPEN_DRAIN, GPIO_PMD_PMD3_MASK);
	GPIO_SetBit(GPIOD, 2);
	GPIO_SetBit(GPIOD, 3);

