xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Samples/Nu_LB/UAC/UAC_Class.c
	/* Set I2C0 I/O multi-function pin */
	GCR->PA_H_MFP = GCR->PA_H_MFP & ~(PA8_MFP_MASK|PA9_MFP_MASK) | 
					PA8_MFP_I2C0_SDA | PA9_MFP_I2C0_SCL;
	
	I2C_Init(I2C0);
	
	/* Open I2C0, and set clock = 100Kbps */
	I2C_Open(I2C0, 100000);	
	
	/* Enable I2C0 interrupt and set corresponding NVIC bit */
	I2C_EnableInt(I2C0);
	
	/* Configure I2S */
	st.u32SampleRate 	 = AUDIO_RATE;

	if (AUDIO_BIT_RATE == 16)
		st.u32WordWidth 	 = I2S_DATABIT_16;
	else if (AUDIO_BIT_RATE == 8)
		st.u32WordWidth 	 = I2S_DATABIT_8;

	if (AUDIO_CHANNELS == 2)
		st.u32AudioFormat = I2S_STEREO;
	else /* AUDIO_CHANNELS = 1 */
		st.u32AudioFormat = I2S_MONO;

	st.u32DataFormat  	 = I2S_FORMAT_I2S;   
    st.u32Mode 		 	 = I2S_MODE_SLAVE;
    st.u32TxFIFOThreshold = I2S_FIFO_TX_LEVEL_WORD_4;
    st.u32RxFIFOThreshold = I2S_FIFO_RX_LEVEL_WORD_4;
	
	I2S_Init();	
	I2S_Open(&st);
	
	/* Configure CODEC */
	WAU8822_Setup();

	/* Set I2S I/O multi-function pin */
	/* GPD2, GPD3, GPD4, GPD5, GPE0 */
	MFP_I2S_TO_PORTD();

	/* Set MCLK and enable MCLK */
	I2S_SetMCLKFreq(12000000);	
	I2S_EnableMCLK(); 
 	 	 	
	/* Initial USB */
	USBD_Init();

	sParam.UsbDeviceClass = USB_CLASS_AUDIO;
	sParam.u32CtrlMaxPacketSize = UAC_MAX_PACKET_SIZE_EP0;
	sParam.u32EndpointCount = 2;
	sParam.EP[0].u32EpNum = ISO_IN_EP_NUM;
	sParam.EP[0].u32MaxPacketSize = MAX_PACKET_SIZE_ISO_IN;
	sParam.EP[0].IsDirIN = TRUE;
	sParam.EP[0].IsIsoTransfer = TRUE;
	sParam.EP[1].u32EpNum = ISO_OUT_EP_NUM;
	sParam.EP[1].u32MaxPacketSize = MAX_PACKET_SIZE_ISO_OUT;
	sParam.EP[1].IsDirIN = FALSE;
	sParam.EP[1].IsIsoTransfer = TRUE;
	USB_Open(&sParam);

	while(1)
	{
	}
}

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/

